Revit 2024 API
UIFabricationUtils Class
 General Fabrication UI utility methods in Revit UI.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static class UIFabricationUtils
Visual Basic
Public NotInheritable Class UIFabricationUtils
Visual C++
public ref class UIFabricationUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIFabricationUtils
See Also
UIFabricationUtils Members
Autodesk.Revit.UI Namespace